[
 {
    "name": "Period 1",
    "number": 1,
    "description": "A period 1 element is one of the chemical elements in the first row (or period) of the periodic table of the chemical elements. The periodic table is laid out in rows to illustrate periodic (recurring) trends in the chemical behaviour of the elements as their atomic number increases: a new row is begun when chemical behaviour begins to repeat, meaning that analog elements fall into the same vertical columns. The first period contains fewer elements than any other row in the table, with only two: hydrogen and helium. This situation can be explained by modern theories of atomic structure. In a quantum mechanical description of atomic structure, this period corresponds to the filling of the 1s orbital. Period 1 elements obey the duet rule in that they need two electrons to complete their valence shell. Hydrogen and helium are the oldest and the most abundant elements in the universe. ",
    "trends": "All other periods in the period table contain at least eight elements, and it is often helpful to consider periodic trends across the period. However, period 1 contains only two elements, so this concept does not apply here. In terms of vertical trends down groups, helium can be seen as a typical noble gas at the head of the IUPAC group 18, but as discussed below, hydrogen's chemistry is unique and it is not easily assigned to any group.[1]",
    "source": "https://en.wikipedia.org/wiki/Period_1_element",
    "source_date": "2020-07-10"
 },
 {
    "name": "Period 2",
    "number": 2,
    "description": "A period 2 element is one of the chemical elements in the second row (or period) of the periodic table of the chemical elements. The periodic table is laid out in rows to illustrate/display recurring (periodic) trends in the chemical behavior of the elements as their atomic number increases; a new row is started when chemical behavior begins to repeat, creating columns of elements with similar properties. The second period contains the elements lithium, beryllium, boron, carbon, nitrogen, oxygen, fluorine, and neon. In a quantum mechanical description of atomic structure, this period corresponds to the filling of the second (n = 2) shell, more specifically its 2s and 2p subshells. Period 2 elements obey the octet rule in that they need eight electrons to complete their valence shell, where at most eight electrons can be accommodated: two in the 2s orbital and six in the 2p subshell.",
    "trends": "Period 2 is the first period in the periodic table from which periodic trends can be drawn. Period 1, which only contains two elements (hydrogen and helium) is too small to draw any conclusive trends from it, especially because the two elements behave nothing like other s-block elements.[1][2] Period 2 has much more conclusive trends. For all elements in period 2, as the atomic number increases, the atomic radius of the elements decreases, the electronegativity increases, and the ionization energy increases.[3] Period 2 only has two metals (lithium and beryllium) of eight elements, less than for any subsequent period both by number and by proportion. It also has the most number of nonmetals, namely five, among all periods. The elements in period 2 often have the most extreme properties in their respective groups; for example, fluorine is the most reactive halogen, neon is the most inert noble gas,[4] and lithium is the least reactive alkali metal.[5] All period 2 elements completely obey the Madelung rule; in period 2, lithium and beryllium fill the 2s subshell, and boron, carbon, nitrogen, oxygen, fluorine, and neon fill the 2p subshell. The period shares this trait with periods 1 and 3, none of which contain transition elements or inner transition elements, which often vary from the rule.[5]",
    "source": "https://en.wikipedia.org/wiki/Period_2_element",
    "source_date": "2020-07-10"
 },
 {
    "name": "Period 3",
    "number": 3,
    "description": "A period 2 element is one of the chemical elements in the second row (or period) of the periodic table of the chemical elements. The periodic table is laid out in rows to illustrate/display recurring (periodic) trends in the chemical behavior of the elements as their atomic number increases; a new row is started when chemical behavior begins to repeat, creating columns of elements with similar properties. The second period contains the elements lithium, beryllium, boron, carbon, nitrogen, oxygen, fluorine, and neon. In a quantum mechanical description of atomic structure, this period corresponds to the filling of the second (n = 2) shell, more specifically its 2s and 2p subshells. Period 2 elements obey the octet rule in that they need eight electrons to complete their valence shell, where at most eight electrons can be accommodated: two in the 2s orbital and six in the 2p subshell.",
    "trends": "In a quantum mechanical description of atomic structure, this period corresponds to the buildup of electrons in the third (n = 3) shell, more specifically filling its 3s and 3p subshells. There is a 3d subshell, but—in compliance with the Aufbau principle—it is not filled until period 4. This makes all eight elements analogs of the period 2 elements in the same exact sequence. The octet rule generally applies to period 3 in the same way as to period 2 elements, because the 3d subshell is normally non-acting.",
    "source": "https://en.wikipedia.org/wiki/Period_3_element",
    "source_date": "2020-07-10"
 },
 {
    "name": "Period 4",
    "number": 4,
    "description": "A period 4 element is one of the chemical elements in the fourth row (or period) of the periodic table of the elements. The periodic table is laid out in rows to illustrate recurring (periodic) trends in the chemical behaviour of the elements as their atomic number increases: a new row is begun when chemical behaviour begins to repeat, meaning that elements with similar behaviour fall into the same vertical columns. The fourth period contains 18 elements beginning with potassium and ending with krypton – one element for each of the eighteen groups. It sees the first appearance of d-block (which includes transition metals) in the table.",
    "trends": "Every single one of these elements is stable,[1] and many are extremely common in the Earth's crust and/or core; it is the last period with no unstable elements at all. Many of the transition metals in period 4 are very strong, and therefore commonly used in industry, especially iron. Three adjacent elements are known to be toxic, with arsenic one of the most well-known poisons, selenium being toxic to humans in large quantities, and bromine, a toxic liquid. Many elements are essential to humans' survival, such as calcium being what forms bones.[2] Progressing towards increase of atomic number, the Aufbau principle causes elements of the period to put electrons onto 4s, 3d, and 4p subshells, in that order. However, there are exceptions, such as chromium. The first eleven elements—K, Ca, and transition metals—have from 1 to 11 valence electrons respectively, which are placed on 4s and 3d. Twelve electrons over the electron configuration of argon reach the configuration of zinc, namely 3d10 4s2. From this element, the filled 3d subshell effectively withdraws from chemistry and the subsequent trend looks much like trends in the periods 2 and 3. The p-block elements of period 4 have their valence shell composed of 4s and 4p subshells of the fourth (n = 4) shell and obey the octet rule. For quantum chemistry namely this period sees transition from the simplified electron shell paradigm to research of many differently-shaped subshells, relative disposition of whose energy levels is governed by interplay of various physical effects. The period's s-block metals put their differentiating electron onto 4s having vacancies among nominally lower n = 3 states – a phenomenon unseen in lighter elements. Contrary, seven elements from zinc to krypton are the heaviest where all electron shells below the valence shell are filled completely. This isn't possible in further periods due to existence of f-subshells starting from n = 4.",
    "source": "https://en.wikipedia.org/wiki/Period_4_element",
    "source_date": "2020-07-10"
 },
 {
    "name": "Period 5",
    "number": 5,
    "description": "The periodic table is laid out in rows to illustrate recurring (periodic) trends in the chemical behaviour of the elements as their atomic number increases: a new row is begun when chemical behaviour begins to repeat, meaning that elements with similar behaviour fall into the same vertical columns. The fifth period contains 18 elements, beginning with rubidium and ending with xenon. As a rule, period 5 elements fill their 5s shells first, then their 4d, and 5p shells, in that order; however, there are exceptions, such as rhodium.",
    "trends": "This period contains technetium, one of the two elements until lead that has no stable isotopes (along with promethium), as well as molybdenum and iodine, two of the heaviest elements with a known biological role,[1][2] and Niobium has the largest magnetic known penetration depth of all the elements. Zirconium is one of the main components of zircon crystals, currently the oldest known minerals in the earth's crust. Many later transition metals, such as rhodium, are very commonly used in jewelry due to the fact that they are incredibly shiny.[3] This period is known to have a large number of exceptions to the Madelung rule.",
    "source": "https://en.wikipedia.org/wiki/Period_5_element",
    "source_date": "2020-07-10"
 },
 {
    "name": "Period 6",
    "number": 6,
    "description": "A period 6 element is one of the chemical elements in the sixth row (or period) of the periodic table of the elements, including the lanthanides. The periodic table is laid out in rows to illustrate recurring (periodic) trends in the chemical behaviour of the elements as their atomic number increases: a new row is begun when chemical behaviour begins to repeat, meaning that elements with similar behaviour fall into the same vertical columns. The sixth period contains 32 elements, tied for the most with period 7, beginning with caesium and ending with radon. Lead is currently the last stable element; all subsequent elements are radioactive. For bismuth, however, its only primordial isotope, 209Bi, has a half-life of more than 1019 years, over a billion times longer than the current age of the universe. As a rule, period 6 elements fill their 6s shells first, then their 4f, 5d, and 6p shells, in that order; however, there are exceptions, such as gold.",
    "trends": "This period contains the lanthanides, also known as the rare earths. Many lanthanides are known for their magnetic properties, such as neodymium. Many period 6 transition metals are very valuable, such as gold, however many period 6 other metals are incredibly toxic, such as thallium. Period 6 contains the last stable element, lead. All subsequent elements in the periodic table are radioactive. After bismuth, which has a half-life or more than 1019 years, polonium, astatine, and radon are some of the shortest-lived and rarest elements known; less than a gram of astatine is estimated to exist on earth at any given time.[1]",
    "source": "https://en.wikipedia.org/wiki/Period_6_element",
    "source_date": "2020-07-10"
 },
 {
    "name": "Period 7",
    "number": 7,
    "description": "A period 7 element is one of the chemical elements in the seventh row (or period) of the periodic table of the chemical elements. The periodic table is laid out in rows to illustrate recurring (periodic) trends in the chemical behaviour of the elements as their atomic number increases: a new row is begun when chemical behaviour begins to repeat, meaning that elements with similar behaviour fall into the same vertical columns. The seventh period contains 32 elements, tied for the most with period 6, beginning with francium and ending with oganesson, the heaviest element currently discovered. As a rule, period 7 elements fill their 7s shells first, then their 5f, 6d, and 7p shells in that order, but there are exceptions, such as uranium. ",
    "trends": "All elements of period 7 are radioactive. This period contains the actinides, which includes plutonium, the naturally occurring element with the heaviest nucleus; subsequent elements must be created artificially. While the first five of these synthetic elements (americium through einsteinium) are now available in macroscopic quantities, most are extremely rare, having only been prepared in microgram amounts or less. The later transactinide elements have only been identified in laboratories in batches of a few atoms at a time. Although the rarity of many of these elements means that experimental results are not very extensive, their periodic and group trends are less well defined than other periods. Whilst francium and radium do show typical properties of their respective groups, actinides display a much greater variety of behaviour and oxidation states than the lanthanides. These peculiarities are due to a variety of factors, including a large degree of spin-orbit coupling and relativistic effects, ultimately caused by the very high positive electrical charge from their massive atomic nuclei. Periodicity mostly holds throughout the 6d series, and is predicted also for moscovium and livermorium, but the other four 7p elements, nihonium, flerovium, tennessine, and oganesson, are predicted to have very different properties from those expected for their groups.",
    "source": "https://en.wikipedia.org/wiki/Period_7_element",
    "source_date": "2020-07-10"
 }
]